app/controllers/categories_controller.rb

  def create
    @category = Category.new category_params

    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Aksiyon"], ["created_at", "2016-03-28 13:51:02.854662"], ["updated_at", "2016-03-28 13:51:02.854662"]]