app/controllers/movies_controller.rb

	def show
		@lastmovies = Movie.last(6)
---
SELECT  "movies".* FROM "movies"  ORDER BY "movies"."id" DESC LIMIT 6

	def create
		@movie = Movie.new movie_params
		if @movie.save
---
INSERT INTO "movies" ("title", "description", "date", "director", "country", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		if @movie.update(movie_params)
---
UPDATE "movies" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image_file_name", "legendoftarzan.jpeg"], ["image_file_size", 71612], ["image_updated_at", "2016-03-20 12:09:16.051386"], ["updated_at", "2016-03-20 12:09:16.136951"], ["id", 5]]

	def filter
		@movies = Movie.all.where(country: params[:country])
---
SELECT "movies".* FROM "movies" WHERE "movies"."country" = ?  [["country", "Turkey"]]

	def find_movie
		@movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 4]]