app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("movie_id", "point", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["movie_id", 1], ["point", "-1"], ["user_id", 1], ["created_at", "2016-03-28 13:34:49.989516"], ["updated_at", "2016-03-28 13:34:49.989516"]]
---
  def create
    @rating = Rating.new rating_params
    @rating.user_id = current_user.id
    if @rating.save